____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
cropping2d_4 (Cropping2D)        (None, 80, 320, 3)    0           cropping2d_input_4[0][0]         
____________________________________________________________________________________________________
averagepooling2d_4 (AveragePooli (None, 40, 160, 3)    0           cropping2d_4[0][0]               
____________________________________________________________________________________________________
lambda_2 (Lambda)                (None, 40, 160, 3)    0           averagepooling2d_4[0][0]         
____________________________________________________________________________________________________
conv_1 (Convolution2D)           (None, 18, 78, 6)     456         lambda_2[0][0]                   
____________________________________________________________________________________________________
conv_2 (Convolution2D)           (None, 7, 37, 12)     1812        conv_1[0][0]                     
____________________________________________________________________________________________________
conv_3 (Convolution2D)           (None, 2, 17, 48)     14448       conv_2[0][0]                     
____________________________________________________________________________________________________
spatialdropout2d_2 (SpatialDropo (None, 2, 17, 48)     0           conv_3[0][0]                     
____________________________________________________________________________________________________
flatten (Flatten)                (None, 1632)          0           spatialdropout2d_2[0][0]         
____________________________________________________________________________________________________
fc_1 (Dense)                     (None, 100)           163300      flatten[0][0]                    
____________________________________________________________________________________________________
fc_2 (Dense)                     (None, 50)            5050        fc_1[0][0]                       
____________________________________________________________________________________________________
fc_3 (Dense)                     (None, 10)            510         fc_2[0][0]                       
____________________________________________________________________________________________________
output (Dense)                   (None, 1)             11          fc_3[0][0]                       
====================================================================================================
Total params: 185,587
Trainable params: 185,587
Non-trainable params: 0
____________________________________________________________________________________________________
